{
  "mira_story_images": {
    "chapters": {
      "chapter1": {
        "title": "Wireless Attacks",
        "background": "A cozy, bustling café interior during daytime with warm lighting, wooden tables, coffee cups, laptops, and people chatting. In the background, visible Wi-Fi signals represented as glowing waves emanating from routers, with one router looking suspicious with red glowing edges. Outdoor view through windows showing a city street.",
        "characters": {
          "mira": "A confident young woman in her 20s with long dark hair, wearing a casual hoodie and jeans, holding a laptop with a determined expression. She has a backpack with tech gadgets and a coffee cup in hand.",
          "alice": "A friendly young woman with curly hair, wearing glasses and a sweater, looking worried at her laptop screen with pop-up windows visible.",
          "friends": "A group of diverse young people (2-3) sitting at tables, some with laptops, others with phones, looking concerned or curious."
        },
        "objects": {
          "laptops": "Modern laptops with glowing screens showing terminal windows and network scanning tools.",
          "routers": "Two wireless routers - one normal looking, one with ominous red lights and fake labels.",
          "coffee_shop": "Café elements: espresso machine, pastries, chalkboard menu, Wi-Fi sign."
        },
        "steps": {
          "step1": {
            "specific_scene": "Mira pointing at a laptop screen showing two identical Wi-Fi networks, Alice looking shocked, terminal window displaying airodump-ng output with highlighted suspicious MAC addresses."
          },
          "step2": {
            "specific_scene": "Mira using aireplay-ng command, deauth packets visualized as lightning bolts striking a fake router, friends cheering in background."
          },
          "step3": {
            "specific_scene": "Mira capturing WPA2 handshake, screen showing four-way handshake packets as glowing data streams."
          },
          "step4": {
            "specific_scene": "Mira analyzing beacon intervals, graphs and charts on screen showing abnormal patterns, suspicious router in corner."
          },
          "step5": {
            "specific_scene": "Mira updating MAC whitelist, screen showing approved device list, friends' devices connecting safely."
          }
        }
      },
      "chapter2": {
        "title": "Information Gathering",
        "background": "Same café setting but with more technical elements - network diagrams on walls, multiple computers, server racks visible in background. Evening lighting with screens casting blue glow.",
        "characters": {
          "mira": "Same as chapter1 but more focused, wearing glasses now, taking notes on a tablet.",
          "tech_friends": "Group of 3-4 friends with various tech setups - one with network cables, another with monitoring tools."
        },
        "objects": {
          "network_tools": "nmap, arp-scan outputs on screens, subnet maps, host enumeration results.",
          "servers": "Router with multiple ports, DHCP server, DNS server represented as glowing boxes.",
          "threat_indicators": "Red warning icons for suspicious hosts, traffic graphs showing anomalies."
        },
        "steps": {
          "step6": {
            "specific_scene": "Mira running nmap scan, screen showing live hosts popping up like targets in a game, suspicious MAC highlighted."
          },
          "step7": {
            "specific_scene": "Mira probing router ports, firewall visualization with ports opening/closing, hidden management interface revealed."
          },
          "step8": {
            "specific_scene": "DHCP traffic capture, multiple DHCP offers visualized as competing signals, rogue server identified."
          },
          "step9": {
            "specific_scene": "DNS queries flowing like rivers, poisoned responses shown as corrupted data streams."
          },
          "step10": {
            "specific_scene": "SSID map expanding like a radar, duplicate networks appearing as clones, suspicious ones flagged."
          }
        }
      },
      "chapter3": {
        "title": "Vulnerability Analysis",
        "background": "High-tech lab setting within the café - vulnerability scanners, security dashboards, code on screens. Dim lighting with multiple monitors showing scan results.",
        "characters": {
          "mira": "Professional look with lab coat over casual clothes, holding clipboard with vulnerability checklist.",
          "security_team": "Small team including Mira and 2-3 others analyzing scan results."
        },
        "objects": {
          "scanners": "Nessus interface, SSL certificates, SQL injection payloads, HTTP headers displayed.",
          "vulnerabilities": "Visual representations of security holes - cracked locks, broken shields, warning signs.",
          "patches": "Code patches, security updates visualized as shields and locks being applied."
        },
        "steps": {
          "step11": {
            "specific_scene": "Nessus scan running, progress bar filling, vulnerabilities appearing as red dots on a network map."
          },
          "step12": {
            "specific_scene": "SSL certificate chain displayed, expired cert shown as crumbling document, replacement cert glowing."
          },
          "step13": {
            "specific_scene": "SQL injection attempt, database tables exposed, input sanitization visualized as filters."
          },
          "step14": {
            "specific_scene": "HTTP headers list, security headers added like armor pieces, clickjacking prevented."
          },
          "step15": {
            "specific_scene": "Default credentials being changed, lock icons replacing weak passwords, strong passwords generated."
          }
        }
      },
      "chapter4": {
        "title": "Web Applications",
        "background": "Web development workspace - multiple browser windows, code editors, web forms on screens. Creative but technical atmosphere.",
        "characters": {
          "mira": "Coder look with keyboard, mouse, multiple browser tabs open.",
          "web_users": "Friends testing web forms, some frustrated with errors, others successful."
        },
        "objects": {
          "web_elements": "Login forms, hidden fields, redirects, directory listings, admin panels.",
          "security_features": "CSP headers, input validation, secure redirects visualized as protective barriers."
        },
        "steps": {
          "step16": {
            "specific_scene": "Form source code revealed, hidden fields exposed like hidden treasures, being removed."
          },
          "step17": {
            "specific_scene": "JavaScript disabled, form validation bypassed, server-side validation added as backup."
          },
          "step18": {
            "specific_scene": "Redirect URL manipulated, phishing site blocked, whitelist enforced."
          },
          "step19": {
            "specific_scene": "Directory listing exposed, files hidden behind locked door, browsing disabled."
          },
          "step20": {
            "specific_scene": "Admin panel brute-forced, rate limiting added as speed bumps, strong auth enforced."
          }
        }
      },
      "chapter5": {
        "title": "Exploitation Tools",
        "background": "Dark, intense hacker lab - multiple terminals, exploit frameworks running, target systems visualized. Dramatic lighting.",
        "characters": {
          "mira": "Serious expression, typing furiously, surrounded by technical readouts.",
          "targets": "Server systems represented as fortified castles being tested."
        },
        "objects": {
          "exploit_tools": "Metasploit console, msfvenom payloads, searchsploit results, custom exploits.",
          "defenses": "Firewalls, IDS systems, patched vulnerabilities shown as reinforced walls."
        },
        "steps": {
          "step21": {
            "specific_scene": "Metasploit auxiliary module running, HTTP login tested, endpoint secured."
          },
          "step22": {
            "specific_scene": "ARP spoofing demonstrated, traffic hijacked, DAI enabled as protective shield."
          },
          "step23": {
            "specific_scene": "Path traversal exploited, file system accessed, input validation added."
          },
          "step24": {
            "specific_scene": "SearchSploit results, CVE details, patch applied like healing a wound."
          },
          "step25": {
            "specific_scene": "msfvenom payload created, reverse shell blocked, egress filtering enforced."
          }
        }
      },
      "chapter6": {
        "title": "Password Attacks",
        "background": "Fortress-like setting with password vaults, cracking tools, hash representations. Medieval castle meets modern tech.",
        "characters": {
          "mira": "Guard stance, protecting password vaults, testing attack tools.",
          "attackers": "Abstract representations of cracking attempts, blocked by defenses."
        },
        "objects": {
          "passwords": "Hash strings, rainbow tables, cracking tools, strong password generators.",
          "defenses": "MFA, lockouts, salted hashes visualized as impregnable walls."
        },
        "steps": {
          "step26": {
            "specific_scene": "WPA2 handshake cracked, new strong PSK set, rotation policy implemented."
          },
          "step27": {
            "specific_scene": "Hydra brute-forcing, account lockout triggered, MFA enabled."
          },
          "step28": {
            "specific_scene": "SSH brute-force attempt, password auth disabled, key-based auth enforced."
          },
          "step29": {
            "specific_scene": "MD5 hash cracked, migrated to bcrypt, salting added."
          },
          "step30": {
            "specific_scene": "Rainbow table attack, salts rendered useless, per-user salts implemented."
          }
        }
      },
      "chapter7": {
        "title": "Reverse Engineering",
        "background": "High-tech disassembly lab - firmware images, binary code, analysis tools. Clean, precise environment.",
        "characters": {
          "mira": "Analyst with magnifying glass, examining code, taking detailed notes.",
          "binaries": "Firmware represented as complex machinery being taken apart."
        },
        "objects": {
          "analysis_tools": "Ghidra interface, Binwalk output, strings results, decompiled code.",
          "firmware": "Router firmware, embedded secrets, backdoors revealed."
        },
        "steps": {
          "step31": {
            "specific_scene": "Binwalk extracting firmware, hidden files revealed, Ghidra analysis."
          },
          "step32": {
            "specific_scene": "Embedded credentials found, patched out, secure login enforced."
          },
          "step33": {
            "specific_scene": "Auth bypass patched, control flow corrected, firmware rebuilt."
          },
          "step34": {
            "specific_scene": "Debug tokens discovered, revoked, firmware updated."
          },
          "step35": {
            "specific_scene": "Patched firmware signed, securely flashed, integrity verified."
          }
        }
      },
      "chapter8": {
        "title": "Social Engineering",
        "background": "Office/meeting room setting with training materials, phishing examples, awareness posters. Collaborative atmosphere.",
        "characters": {
          "mira": "Trainer role, presenting to group, demonstrating attacks and defenses.",
          "staff": "Diverse group learning about social engineering, some falling for demos."
        },
        "objects": {
          "phishing": "Fake emails, malicious links, training materials, awareness campaigns.",
          "defenses": "CSRF tokens, caller ID verification, USB policies."
        },
        "steps": {
          "step36": {
            "specific_scene": "Phishing email analyzed, site taken down, staff training session."
          },
          "step37": {
            "specific_scene": "CSRF token implemented, cross-site requests blocked."
          },
          "step38": {
            "specific_scene": "Voicemail spoof detected, verification protocols deployed."
          },
          "step39": {
            "specific_scene": "BLE beacons scanned, rogue ones blocked, auth enforced."
          },
          "step40": {
            "specific_scene": "USB autorun disabled, user training conducted, policies set."
          }
        }
      },
      "chapter9": {
        "title": "Sniffing & Spoofing",
        "background": "Network monitoring center - packet captures, traffic analysis, spoofing demonstrations. High-tech surveillance feel.",
        "characters": {
          "mira": "Network analyst, monitoring traffic, detecting anomalies.",
          "traffic": "Data packets visualized as flowing streams, some corrupted or spoofed."
        },
        "objects": {
          "network_tools": "Wireshark captures, tcpdump output, Bettercap interface, scapy scripts.",
          "attacks": "ARP spoofing, DNS poisoning, HTTP injection represented as attacks."
        },
        "steps": {
          "step41": {
            "specific_scene": "Guest traffic sniffed, cleartext leaks identified, HTTPS enforced."
          },
          "step42": {
            "specific_scene": "DNS poisoning detected, cache flushed, DNSSEC enabled."
          },
          "step43": {
            "specific_scene": "ARP spoof test, DAI enabled, traffic protected."
          },
          "step44": {
            "specific_scene": "JS injection tested, CSP implemented, payloads filtered."
          },
          "step45": {
            "specific_scene": "DHCP spoof simulated, snooping configured, rogue blocked."
          }
        }
      },
      "chapter10": {
        "title": "Post Exploitation",
        "background": "Incident response center - cleanup tools, recovery procedures, security hardening. Urgent but organized atmosphere.",
        "characters": {
          "mira": "Incident responder, coordinating cleanup, implementing fixes.",
          "compromised_systems": "Systems shown as damaged but being repaired."
        },
        "objects": {
          "cleanup_tools": "Cron job removers, hash deleters, account auditors, log restorers.",
          "recovery": "Backups restored, permissions fixed, monitoring enabled."
        },
        "steps": {
          "step46": {
            "specific_scene": "Malicious cronjob removed, crontab restricted to admins."
          },
          "step47": {
            "specific_scene": "Hash dumps deleted, file permissions locked down."
          },
          "step48": {
            "specific_scene": "Backdoor account deleted, passwords rotated, monitoring added."
          },
          "step49": {
            "specific_scene": "Logs restored from backups, immutable logging configured."
          },
          "step50": {
            "specific_scene": "DNS tunneling detected, rate limits applied, monitoring set."
          }
        }
      },
      "chapter11": {
        "title": "Forensics",
        "background": "Digital forensics lab - evidence boards, timeline displays, analysis tools. CSI-style investigation room.",
        "characters": {
          "mira": "Forensic investigator, examining evidence, building timeline.",
          "evidence": "Log files, memory dumps, browser caches, timelines."
        },
        "objects": {
          "forensic_tools": "Volatility, extundelete, Plaso, Wireshark, timeline builders.",
          "artifacts": "Deleted files recovered, memory analyzed, caches inspected."
        },
        "steps": {
          "step51": {
            "specific_scene": "Deleted auth logs recovered, integrity verified."
          },
          "step52": {
            "specific_scene": "Memory dump analyzed, unauthorized processes terminated."
          },
          "step53": {
            "specific_scene": "Browser cache inspected, credentials purged."
          },
          "step54": {
            "specific_scene": "ARP cache timeline built, rogue MAC isolated."
          },
          "step55": {
            "specific_scene": "Event timeline merged, intrusion markers identified, gaps secured."
          }
        }
      }
    },
    "general_elements": {
      "ui_elements": "Terminal windows with green text on black background, progress bars, command outputs, tool interfaces.",
      "animations": "Data flowing as streams, packets as glowing orbs, attacks as red energy waves, defenses as blue shields.",
      "style": "Cyberpunk meets cozy café - warm colors for safe elements, cool blues for tech, red for threats, consistent character designs across scenes."
    }
  }
}
